app/views/articles/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 22]]
---
    <p><font size="1">Posted on: <%= article.created_at.strftime("%B %d, %Y at %H:%M") %></font></p>
    <p><font size="2"><%= article.comments.length %> comments</font></p>