app/controllers/articles_controller.rb

	def index
		@articles = Article.order(created_at: :desc).limit(10)
		@articles.each do |article|
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC
SELECT  "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT ?  [["LIMIT", 1]]

	def admin
		@articles = Article.order(created_at: :desc)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC

	def create
		@article = Article.new(article_params)
		# @article.save
		# redirect_to @article

		if @article.save
---
INSERT INTO "articles" ("title", "subtitle", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "213"], ["subtitle", "123"], ["body", "3123"], ["created_at", "2018-03-19 02:50:58.274865"], ["updated_at", "2018-03-19 02:50:58.274865"]]