app/controllers/comments_controller.rb

	def index
		if @article = Article.find_by_id(params[:id])
	  	@comments = @article.comments.order(created_at: :desc).select(:id, :author, :comment)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "comments"."id", "comments"."author", "comments"."comment" FROM "comments" WHERE "comments"."article_id" = $1 ORDER BY "comments"."created_at" DESC  [["article_id", 16]]

	def show
		if @article = Article.find_by_id(params[:id])
			if @comment = @article.comments.where(id: params[:comment_id]).select(:id, :author, :comment)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "comments"."id", "comments"."author", "comments"."comment" FROM "comments" WHERE "comments"."article_id" = $1 AND "comments"."id" = $2  [["article_id", 16], ["id", nil]]

	def create
		if @article = Article.find_by_id(params[:id])
   		@comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "comment", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "a"], ["comment", "a"], ["article_id", 16], ["created_at", "2018-03-19 16:25:16.298920"], ["updated_at", "2018-03-19 16:25:16.298920"]]

	def destroy
		if @article = Article.find_by_id(params[:id])
   		@comment = @article.comments.where(id: params[:comment_id])
   		if !@comment.empty?
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
SELECT  1 AS one FROM "comments" WHERE "comments"."article_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["article_id", 33], ["id", 11], ["LIMIT", 1]]

	def update
		if @article = Article.find_by_id(params[:id])
   		if @comment = @article.comments.where(id: params[:comment_id])
	  		if @comment.update(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1 AND "comments"."id" = $2  [["article_id", 30], ["id", 9]]
UPDATE "comments" SET "author" = $1, "comment" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["author", "Autor 3 del comentario"], ["comment", "contenido 3 del comentario"], ["updated_at", "2018-04-03 18:30:58.934523"], ["id", 9]]